app/views/blogs/show.html.erb

SELECT "blogs".* FROM "blogs"
---
  <ul class="pager" style="padding-left: 20px; padding-right: 20px">
    <% if @blog.id.to_i == Blog.all.first.id %>

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT 1  [["id", "10"]]
---
        <li class="next">
          <a href="<%= blog_path(Blog.find(@blog.id.to_i + 1))%>" style="background-color: transparent; color: #006688; border-color: transparent; padding-top: 5px">Next &rarr;</a>

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 10
---
        <ul>
        <% @blog.comments.each do |comment| %>